{
  "msg": "success",
  "code": 200,
  "data": {
    "totalCount": 0,
    "pageSize": -1,
    "totalPage": 0,
    "currPage": 1,
    "list": [
      {
        "id": "796235613736030209",
        "title": "论企业智能运维技术与方法<br> 智能运维（Artificial Intelligence for IT Operations, AIOps）是将人工智能应用于运维领域，基于已有的运维数据（日志数据、监控数据、应用信息等），采用机器学习方法来进一步解决自动化运维难以解决的问题。具体来说，智能运维在自动化运维的基础上，增加了一个基于机器学习的智能决策模块，控制监测系统采集运维决策所需的数据，做出智能分析与决策，并通过自动化脚本等手段去执行决策，以达到运维系统的整体目标。 智能运维能够提高企业信息系统的预判能力和稳定性，降低IT成本，提升企业产品的竞争力。\n请围绕“企业智能运维技术与方法”论题，依次从以下三个方面进行论述。<br> 1. 概要叙述你参与管理与实施的软件运维项目以及你在其中所担任的主要工作。<br> 2. 智能运维主要从效率提高、质量保障和成本管理等三个方面提升运维水平，其成熟程度可以分为尝试应用、单点应用、串联应用、能力完备和能力成熟等五个级别，请任意选择三个成熟度级别，说明其在效率提升、质量保障和成本管理等方面的特征。<br> 3. 结合你具体参与管理与实施的实际软件系统运维项目，举例说明如何采用智能运维技术和方法提高运维效率、保障运维质量并降低运维成本，实施效果如何。在智能运维过程中都遇到了哪些具体问题，是如何解决的。",
        "analyze": "一、简要描述所参与管理与实施的软件系统运维项目，并明确指出在其中承担的主要任务和开展的主要工作。<br> 二、智能运维主要从效率提高、质量保障和成本管理等三个方面提升运维水平，其成熟程度可以分为尝试应用、单点应用、串联应用、能力完备和能力成熟等五个级别，每个级别在效率提升、质量保障和成本管理的特征如下表所示：<br> <img src=\"https://image-t.chaiding.com/ruankao/a4d51024e73632a2ac3e180085b52681.jpg-ruankao\" alt=\"\" width=\"580\" height=\"114\" title=\"\" align=\"\"><br> <img src=\"https://image-t.chaiding.com/ruankao/9b712e4d2b2ab746cb0ec21f6eb928f2.jpg-ruankao\" alt=\"\" width=\"600\" height=\"482\" title=\"\" align=\"\"><br> (可以任意选取三个级别，每个级别需要描述效率提升、质量保障和成本管理三个方面的特征进行论述）<br> 三、针对具体参与管理与实施的实际软件系统运维项目，说明采用了哪些具体的智能运维技术和方法，解决了何种运维问题，如何提高运维效率，保障运维质量并降低运维成本，实施的效果如何。并且需要举例说明在实施智能运维过程中遇到了哪些实际的问题，具体的解决方案是什么。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235617724813313",
        "title": "论信息系统开发方法论<br>信息系统的开发一般分为系统规划、需求定义、系统设计、实施和维护等主要五个阶段，每一个阶段都应该在科学方法论的指导下开展工作。随着信息系统规模的变化和传统开发方法论的演变，信息系统开发过程经历了“自底向上”和“自顶向下”两种方式。\n请围绕“信息系统开发方法论”论题，依次从以下三个方面进行论述。<br>1．概要叙述你参与分析和开发的信息系统以及你所担任的主要任务和开展的主要工作。<br>2．分别说明信息系统“自底向上”和“自顶向下”两种系统分析设计方式。详细阐述系统遵循“自底向上”方式和“自顶向下”方式设计开发的优缺点。<br>3．详细说明你所参与的信息系统是如何遵循“自底向上”、“自顶向下”或综合“自底向上”和“自顶向下”两种方式进行的分析、设计和开发的。",
        "analyze": "一、简要描述所参与分析和开发的软件系统开发项目，并明确指出在其中承担的主要任务和开展的主要工作。<br>二、分别说明信息系统“自底向上”和“自顶向下”两种系统分析设计方式。详细阐述系统遵循“自底向上”方式和“自顶向下”方式设计开发的优缺点。<br>1. “自底向上”方式<br>早期对信息系统的分析、设计和开发方法山于规模较小，基本上是采用“自下而上”的，或称“自底向上”的方式。系统的开发是从单项、局部的应用向多项、全面的应用发展。它们从部分现有的应用向外或向上延伸和扩展，这种方法主要用于对早期的事务处理应用。一些系统加上另外一些系统，将它们联系起来使企业的信息系统逐渐扩大，从而支持管理部门的业务控制、管理规划甚至战略决策。它们是从现有的信息系统开始，根据企业需求的变化而不断演化。所以“自底向上”的分析、设计和开发方法也称为演变法。<br>自底向上方法的优点有：<br>•使信息系统的开发易于适应组织机构的真正需要。<br>•有助于发现和理解每个系统的附加需要，并易于判断其费用。<br>•每一阶段所获得的经验和教训有助于下一阶段的开发。<br>•相对而言，每一阶段的规模较小，易于控制和管理。<br>自底向上方法的缺点有：<br>•由于方法的演变性质，信息系统难以实现其整体性。<br>•由于系统未进行全局规划，系统的数据一致性和完整性难以保证。<br>•为了达到系统的性能要求，往往不得不重新调整系统，甚至要重新设计系统。<br>•由于系统实施的分散性和演变性，因而与企业目标的联系往往是间接的，系统往往难以支持企业的整体战略目标。<br>2. “自顶向下”方式<br>随着信息系统规模的不断扩大和对传统开发方法论的探讨，另一种系统开发的方法论被提倡和发展，这就是所谓“自顶向下”的系统分析、设计和开发方法，这也是当前大系统开发所常用的方法。它是从企业或部门的经营和管理目标出发，从全局和整体来规划其信息需求。它从企业或机构的最高层出发并覆盖所有或主要的业务领域。运用这类方法可以为企业或部门信息系统制定中期或长期发展规划奠定基础。自顶向下方法在一定程度上保证了合理的开发顺序和所有应用的最后整体化。<br>自顶向下方法的优点有：<br>•可为企业或机构的重要决策和任务实现提供信息。<br>•支持企业信息系统的整体性规划，并对系统的各子系统的协调和通信提供保证。<br>•方法的实践有利于提高企业人员的整体观察问题的能力，从而有利于寻找到改进企业组织的途径。<br>自顶向下方法的缺点有：<br>•对系统分析和设计人员的要求较高。<br>•开发周期长。<br>•对于大系统而言，自上而下的规划对于下层系统的实施往往缺乏约束力。<br>•从经济角度来看，很难说自顶向下的做法在经济上是合算的。<br>上述在信息系统开发时常见的两种实施方法，是对不同时期、不同对象的信息系统开发方法的归纳，各有其优缺点，但实践证明在工程实施时，两种方法并非是绝对排斥的，往往在事情进一步的发展中，它们都能取长补短、相互补充。有经验的分析和设计人员会首先确定企业的信息需求环境和性质，然后来选择适合于它的分析和设计方法，他们甚至会从方法的基本原理和适应对象出发使用变通的方法来进行对特定系统的开发，如自顶向下的整体规划和自底向上的分步实施。这无疑是一种对方法论的发展和创造。<br>三、针对作者实际参与的软件系统开发项目，说明该项目是如何遵循“向底向上”“自顶向下”或综合“自底向上”和“自顶向下”两种方式进行的系统分析、设计和开发的。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235582417162241",
        "title": "论原型法及其在信息系统开发中的应用<br> 作为一种信息系统开发方法，原型法（Prototyping）被普遍使用，原型法是指在获取一组基本的需求定义后，利用可视化的开发工具，快速建立一个目标系统的最初版本，并交由用户试用，并根据用户反馈进行补充和修改，再形成新的版本。反复进行这个过程，直到得出系统的“精确解”，即用户满意为止。\n请围绕“原型法及其在信息系统开发中的应用”论题，依次从以下三个方面进行论述。<br> 1.概要叙述你参与管理和开发的软件项目以及你在其中所承担的主要工作。<br> 2.请简要描述原型法的开发过程。<br> 3.具体阐述你参与管理和开发的项目是如何基于原型法进行信息系统开发的。",
        "analyze": "论文暂无解析",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235611689209857",
        "title": "论处理流程设计方法及应用<br> 处理流程设计（Process Flow Design,PFD）是软件系统设计的重要组成部分，它的主要目的是设计出软件系统所有模块以及它们之间的相互关系，并具体设计出每个模块内部的功能和处理过程，包括局部数据组织和控制流，以及每个具体加工过程和实施细节，为实现人员提供详细的技术资料。每个软件系统都包含了一系列核心处理流程，对这些处理流程的理解和设计将直接影响软件系统的功能和性能。因此，设计人员需要认真掌握处理流程的设计方法。\n请围绕“处理流程设计方法及应用”论题，依次从以下三个方面进行论述。<br> 1. 简要叙述你参与的软件开发项目以及你所承担的主要工作。<br> 2. 详细说明目前主要有哪几类处理流程设计工具，每个类别至少详细说明一种流程设计工具。<br> 3. 根据你所参与的项目，说明是具体采用哪些流程设计工具进行流程设计的，实施效果如何。",
        "analyze": "写作要点<br> 一、简要描述所参与的软件系统开发项目，并明确指出在其中承担的主要任务和开展的主要工作。<br> 二、详细说明目前主要有哪几类处理流程设计工具，每个类别至少详细说明一种流程设计工具。<br> 1.图形工具（程序流程图、IPO图、N-S图、问题分析图）<br> (1)程序流程图。<br> 程序流程图（Program Flow Diagram,PFD)用一些图框表示各种操作，它独立于任何一种程序设计语言，比较直观、清晰，易于学习掌握。为更好地使用流程图描述结构化程序，必须对流程图进行限制，流程图中只能包括5种基本控制结构，任何复杂的程序流程图都应由这5种基本控制结构组合或嵌套而成。<br> (2)IPO图。<br> IPO图是由IBM公司发起并逐步完善的一种流程描述工具。系统分析阶段产生的数据流图经转换和优化后形成的系统模块结构图的过程中将产生大量的模块，分析与设计人员应为每个模块写一份说明，即可用IPO图来对每个模块进行表述，IPO图用来描述每个模块的输入、输出和数据加工。<br> (3)N-S图。<br> N-S图中也包括5种控制结构，分别是顺序型、选择型、WHILE循环型（当型循环）、UNTIL循环型（直到型循环）和多分支选择型，任何一个N-S图都是这5种基本控制结构相互组合与嵌套的结果。在N-S图中，过程的作用域明确；它没有箭头，不能随意转移控制；而且容易表示嵌套关系和层次关系；并具有强烈的结构化特征。<br> (4)问题分析图。<br> 问题分析图是一种支持结构化程序设计的图形工具。PAD也包含5种基本控制结构，并允许递归使用。PAD的执行顺序是从最左主干线的上端的结点开始，自上而下依次执行。每遇到判断或循环，就自左而右进入下一层，从表示下一层的纵线上端开始执行，直到该纵线下端，再返回上一层的纵线的转入处。如此继续，直到执行到主干线的下端为止。<br> 2.表格工具（判定表）<br> (1)判定表。<br> 对于具有多个互相联系的条件和可能产生多种结果的问题，用结构化语言描述则显得不够直观和紧凑，这时可以用以清楚、简明为特征的判定表（Decision Table)来描述。判定表采用表格形式来表达逻辑判断问题，表格分成4个部分，左上部分为条件说明，左下部分为行动说明，右上部分为各种条件的组合说明，右下部分为各条件组合下相应的行动。在表的右上部分中列出所有条件，T表示该条件取值为真，F表示该条件取值为假，空白表示这个条件无论取何值对动作的选择不产生影响，在判定表右下部分中列出所有的处理动作，Y表示执行对应的动作，空白表示不执行该动作；判定表右半部分的每一列实质上是一条规则，规定了与特定条件取值组合相对应的动作。<br> 3.语言工具（过程设计语言）<br> (1)过程设计语言。<br> 过程设计语言是一种混合语言，采用自然语言的词汇和结构化程序设计语言的语法，用于描述处理过程怎么做，类似于编程语言。过程设计语言用于描述模块中算法和加工逻辑的具体细节，以便在开发人员之间比较精确地进行交流。过程设计语言的语法规则一般分为外层语法和内层语法。外层语法用于描述结构，采用与一般编程语言类似的关键字（例如，IF-THEN-ELSE,WHIEL-DO等)，外层语法应当符合一般程序设计语言常用语句的语法规则；内层语法用于描述操作，可以采用自然语句（例如，英语和汉语等）中的一些简单的句子、短语和通用的数学符号来描述程序应执行的功能。过程设计语言仅仅是对算法或加工逻辑的一种描述，是不可执行的。使用过程设计语言，可以做到逐步求精，从比较概括和抽象的过程设计语言程序开始，逐步写出更详细、更精确的描述，其写法比较灵活，它使用自然语言来描述处理过程，不必考虑语法错误，有利于设计人员把主要精力放在描述算法和加工逻辑上。<br> 三、针对考生本人所参与的项目中使用的流程设计工具，说明实施过程和具体实施效果。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235624314064897",
        "title": "论数据挖掘方法及应用<br>随着信息技术和数据库技术的普遍应用，人类获取数据的能力不断增强，数据库的数量和规模在迅速增加。数据挖掘又称数据库中的知识发现（Knowledge Discover in Database, KDD），是识别数据库中以前不知道的、新颖的、潜在有用的和最终可被理解的模式的非平凡过程。数据挖掘是数据库知识发现过程的一个步骤，其目标就是要智能化和自动化地把数据转换为有用的信息和知识。\n请围绕“数据挖据方法及应用”论题，依次从以下三个方面进行论述。<br>1.概要叙述你参与分析和开发的软件系统以及你所担任的主要任务和开展的主要工作。<br>2.详细阐述三种常用的数据挖掘方法。<br>3.详细说明你所参与分析和开发的软件系统是如何基于常用的数据挖掘方法进行数据挖掘的。",
        "analyze": "一、简要描述所参与分析和开发的软件系统开发项目，并明确指出在其中承担的主要任务和开展的主要工作。<br>二、详细阐述三种常用的数据挖掘方法。<br>考生阐述下列方法中的任意3种即可得分。<br>1. 关联规则挖掘。关联规则挖掘的典型问题是：给定一个销售交易的数据库，要求发现数据项之间的重要关联性，即在一个交易中出现某些数据项蕴含着其他一些数据项也可能会在同一交易中出现。例如许多顾客在购买尿布的同时也购买啤酒的结论就足通过关联规则分析所得到的结果。关联规则分析是一个从现象到本质的揣测推现过程。也就是说，通过关联分析所得到的结果，仅仅是一种可能的因果关系，它能够协助业务专家对事物的本质进行分析，深化对事物关系的认识，但需要业务专家加以确认，并予以合理的解释，才能够成为对决策进行指导的规律。<br>2. 特征描述。数据库中通常存放大量的细节数据，然而，用户常常希望能够得到对于所关心的一类数据的简洁概貌描述。特征描述是对目标类数据的一般特征或特性进行汇总，并以直观易理解的方式显示给用户。通常，用户首先通过数据库査询来对目标类数据进行查询，例如为研究上一年在某超市消费超过1000美元以上的顾客特征，可以通过执行一个SQL査询收集关于这些产品的数据。特征描述通常采用的方法足进行数椐概化，将庞大的任务相关的数据集从较低的概念层抽象到较高的概念层。例如，对于上述消费超过1000美元以上的顾客，特征描述的结果可能是顾客的一般轮廓，如年龄在40至50岁之间、已婚、有工作等。<br>3. 分类分析。分类分析是找出数据集中各组对象的共同特征，并建立分类模型，从而能够将数据集中的其他对象分到不同的组中分类也称作制导的学习，为了建立分类模型，需要有一个用做训练集的示例数据库E，其中的每个元组都有一个给定的类标识。分类过程是首先分析训练集中的数掘，根据每个类中数据的特征为每个类生成分类模型，然后用得到的分类模型对未知类別的数据进行分类。表示分类模型的一种常用方法是决策树。<br>4. 聚类分析。若干个相似的数据对象组合在一起称作一个聚簇。聚类分析是将数据集分割为若干个有意义的聚簇的过程。聚类分析也称作无制导的学习，因为聚类分析与分类分析不同，它不依赖于没有事先确定的类，也没有已具有类标识的训练集。好的聚类分析算法应该使得所得到的聚簇内的相似性很高，而不同的聚族间的相似性很低。<br>三、针对考生实际参与的软件系统开发项目，说明该项目是如何基于常用的数据挖掘方法进行数据挖掘的。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235609646583809",
        "title": "论系统自动化测试及其应用<br> 软件系统测试是在将软件交付给客户之前所必须完成的重要步骤之一，目前，软件测试仍是发现软件缺陷的主要手段。软件系统测试的对象是完整的、集成的计算机系统，系统测试的目的是验证完整的软件配置项能否和系统正确连接，并满足系统设计文档和软件开发合同规定的要求。系统测试工作任务难度高，工作量大，存在大量的重复性工 作，因此自动化测试曰益成为当前软件系统测试的主要手段。\n请围绕“系统自动化测试及其应用”论题，依次从以下三个方面进行论述。<br> 1. 概要叙述你参与管理和开发的软件项目以及你在其中所担任的主要工作。<br> 2. 详细论述系统自动化测试的主要工作内容及优缺点。<br> 3. 结合你具体参与管理和开发的实际项目，说明是如何进行系统自动化测试的，说明具体实施过程以及应用效果。",
        "analyze": "写作要点<br> 一、简要叙述所参与管理和开发的软件项目，并明确指出在其中承担的主要任务和开展的主要工作。<br> 自动化测试通常需要构建存放程序软件包和测试软件包的文件服务器，存储测试用例和测试结果的数据库服务器，执行测试的运行环境，控制服务器，Web服务器和客户端程序。自动化测试工具应该包含对测试执行的支撑功能，具体应包括：具备相应的容错处理系统，能够自动处理测试中的异常情况；提供测试的集成环境，支持对脚本的执行、跟踪、检查、错误定位，以及故障重演等能力，并提供对外部自动化测试工具的集成扩展能力；提供对脚本代码的控制与管理等。<br> 自动化测试的优点：<br> 1.提高测试执行的速度；<br> 2.提高工作效率；<br> 3.保证测试结果的准确性；<br> 4.连续运行测试脚本；<br> 5.模拟现实环境下受约束的情况。<br> 自动化测试存在受约束的情况。例如：自动化测试不能取代手工测试，能够发现的缺陷不如手工测试；自动化测试对所测产品质量的依赖性大；测试工具本身不具备智能与想象力，依然需要人工介入。<br> 考生需结合自身参与项目的实际情况，指出其在参与管理和开发的项目中所进行的系统测试活动，说明该活动的具体实施过程、使用方法和自动化测试工具，并对实际应用效果进行分析。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235607612346369",
        "title": "论系统需求分析方法<br> 系统需求分析是开发人员经过调研和分析，准确理解用户和项目的功能、性能、可靠性等要求，将用户非形式的诉求表述转化为完整的需求定义，从而确定系统必须做什么的过程。系统需求分析具体可分为功能性需求、非功能性需求与设计约束等三个方面。\n请围绕“系统需求分析方法”论题，依次从以下三个方面进行论述。<br> 1. 概要叙述你参与管理和开发的软件项目以及你在其中所担任的主要工作。<br> 2. 详细论述系统需求分析的主要方法。<br> 3. 结合你具体参与管理和开发的实际软件项目，说明是如何使用系统需求分析方法进行系统需求分析的，说明具体实施过程以及应用效果。",
        "analyze": "写作要点<br> 一、简要叙述所参与管理和开发的软件项目，并明确指出在其中承担的主要任务和开展的主要工作。<br> 二、从系统分析出发，可将需求分析方法大致分为功能分解方法、结构化分析方法、信息建模方法和面向对象的分析方法。<br> (1)功能分解方法。<br> 将新系统作为多功能模块的组合。各功能模块可分解为若干子功能及接口，子功能再继续分解。便可得到系统的雏形，即功能分解：功能、子功能和功能接口。<br> (2)结构化分析方法。<br> 结构化分析方法是一种从问题空间到某种表示的映射方法，是结构化方法中重要且被普遍接受的表示系统，由数据流图和数据词典构成并表示。此分析法又称为数据流法。其基本策略是跟踪数据流，即研宄问题域中数据流动方式及在各个环节上所进行的处理，从而发现数据流和加工。结构化分析可定义为数据流、数据处理或加工、数据存储、端点、处理说明和数据字典。<br> (3)信息建模方法。<br> 它从数据角度对现实世界建立模型。大型软件较复杂。很难直接对其分析和设计，常借助模型。模型是开发中常用工具，系统包括数据处理、事务管理和决策支持。实质上，也可看成由一系列有序模型构成，其有序模型通常为功能模型、信息模型、数据模型、控制模型和决策模型。有序是指这些模型是分别在系统的不同开发阶段及开发层次一同建立的。建立系统常用的基本工具是E-R图。经过改进后称为信息建模法，后来又发展为语义数据建模方法，并引入了许多面向对象的特点。<br> 信息建模可定义为实体或对象、属性、关系、父类型/子类型和关联对象。此方法的核心概念是实体和关系，基本工具是E-R图，其基本要素由实体、属性和联系构成，该方法的基本策略是从现实中找出实体，然后再用属性进行描述。<br> (4)面向对象的分析方法。<br> 面向对象的分析方法的关键是识别问题域内的对象，分析它们之间的关系，并建立三类模型，即对象模型、动态模型和功能模型。面向对象主要考虑类或对象、结构与连接、继承和封装、消息通信。这些只表示面向对象分析中几项最重要特征。类的对象是对问题域中事物的完整映射，包括事物的数据特征（即属性）和行为特征（即服务）。<br> 三<span>、</span>考生需结合自身参与项目的实际状况，指出其参与管理和开发的项目中如何应用系统需求分析方法进行系统需求分析的，说明具体实施过程、使用的方法，并对实际应用效果进行分析。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235620098789377",
        "title": "论软件构件管理及其应用<br>软件构件是软件复用的重要组成部分，为了达到软件复用的目的，构件应当是高内聚的，并具有稳定的对外接口。同时为了使构件更切合实际、更有效地被复用，构件应当具备较强的适应能力，以提高其通用性。而存在大量的、可复用的构件是有效使用复用技术的前提。对大量构件进行有效管理，以方便构件的存储、检索和提取，是成功复用构件的必要保证。<br>\n请围绕“软件构件管理及其应用”论题，依次从以下三个方面进行论述。<br>1．简要叙述你参与管理和开发的软件项目以及你在其中所担任的主要工作。<br>2．详细说明构件管理中常见的构件获取方法，以及构件组织分类的常见方法。<br>3．结合你具体参与管理和开发的实际项目，说明在项目中如何获取和组织构件，以及如何进行构件组装。\n<div>\n &nbsp;\n</div>",
        "analyze": "一、简要叙述你参与管理和开发的软件项目以及你在其中所枳仟的主要工作。<br>二、详细说明构件管理中常见的构件获取方法，以及构件组织分类的常见方法。<br>常见的构件获取方法有：<br>1. 从现有构件中获得符合要求的构件，直接使用或作适应性修改，得到可复用的构件;<br>2. 通过遗留工程，将具有潜在复用价值的构件提取出来，得到可复用的构件；<br>3. 从市场上购买现成的商业构件，即COTS(Commercial Off-The-Shell)构件;<br>4. 开发新的符合要求的构件。<br>企业或项目组进行构架获取决策时，必须考虑到不同方式获取构件的一次性成本和以后的维护成本。<br>常见的构件组织分类方法有：<br>1. 关键字分类法：将应用领域的概念按照从抽象到具体的顺序主次分解为树形或有向无回路图结构，每个概念用一个描述性的关键字表示。构件库中新增构件时，需要对构件的功能或行为进行分析。若存在该构件的属主关键字，则在已有的关键字分类结构中，加入到最合适的原子级关键字之下。如果无法找到该构件的属主关键字，则引进新的关键宁，扩充原有的关键字分类结构。<br>2. 刻面(facet)分类法：定义若干用于刻画构件特征的“刻而”，每个面包含若干个概念，这些概念描述构件在刻面上的特点。刻面可以描述构件执行的功能、被操作的数据、构件应用的语境及其他特征。描述构件的刻面集合称为刻面描述符。<br>3. 超文本方法：基于全文检索技术，其主要思想是所有构件必须附以详尽的功能或行为说明文档；说明中出现的重要概念或构件以网状链接方式相互连接；检索者在阅读文档的过程中可按照人类的联想思维方式任意跳转到包含相关概念或构件的文档；全文检索系统将用户给出的关键字与说明文档中的文字进行匹配，实现构件的浏览式检索。<br>三、结合你具体参与管理和开发的实际项目，说明在项目中如何获取和组织构件，以及如何进行构件组装。<br>说明自己在项目中具体所采用的构件获取和组织的方法。<br>构件组装是指将库中的构件经适当修改后相互连接，或者将它们与当前开发系统中的软件元素相连接，最终构成新的目标软件。构件组装技术大致可以分为三种：<br>1. 基于功能的组装技术：采用子程序调用和参数传递的方式将构件组装起来。要求库中的构件以子程序/过程/函数的形式出现，并且接口说明必须清晰。此方法依赖于功能分解的设计方法。<br>2. 基于数据的组装技术：首先根据当前软件问题的核心数据结构设计出一个框架，然后根据框架中各节点的需求提取构件并进行适应性修改，再将构件逐个分配至框架中的适当位置。构件的组装方式仍然是传统的子程序调用与参数传递。此方法依赖于而向数据的设计方法。<br>3. 面向对象的组装技术：由于封装和继承特征，面向对象方法比其他软件开发方法更适合支持软件复用。在面向对象软件开发方法中，如果从类库中检索出来的基类能够完全满足新系统的需求，可以直接使用；否则必须以基类为父类，生成相应的子类，满足新系统的需求。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235622250467329",
        "title": "论软件系统需求获取技术及应用<br>需求获取（Requirement Discovery, RD）是一个确定和理解不同类用户的需要和约束的过程。需求获取是否科学、充分对所获取的结果影响很大，直接决定了系统开发的目标和质量。由于大部分用户无法完整的描述需求，也不可能看到系统的全貌，所以在需求获取中，系统分析师需要与用户进行有效沟通和合作才能成功。系统分析师根据要获取的信息内容和信息来源采用不同的需求获取技术，并且熟练地在实践中运用它，进而获得用于描述系统活动的特定软件需求，构建系统开发目标和质量要求。\n请围绕“软件系统需求获取技术及应用”论题，依次从以下三个方面进行论述。<br>1.简要叙述你参与的软件开发项目以及你所承担的主要工作。<br>2.详细说明目前主要有哪些需求获取技术，不同需求获取技术各自有哪些特点。<br>3.根据你所参与的项目，具体阐述如何根据需求内容采用不同的需求获取技术获取系统需求。",
        "analyze": "—、简要描述所参与的软件系统开发项目，并明确指出在其中承担的主要任务和开展的主要工作。<br>二、详细说明目前主要有哪些需求获取技术，不同需求获取技术各自有哪些特点。<br>1.用户访谈<br>用户访谈是最基本的一种需求获取手段，其形式包括结构化和非结构化两种。结构化是指事先准备好一系列问题，有针对地进行；而非结构化则是只列出一个粗略的想法，根据访谈的具体情况发挥。最有效的访谈是结合这两种方法进行，毕竟不可能把什么都一一计划淸楚，应该保持良好的灵活性。为了进行有效的用户访谈，系统分析师需要在三个方面进行组织，分别是准备访谈、主持访谈和访谈的后续工作。<br>用户访谈具有良好的灵活性，有较宽广的应用范围。但是，也存在着许多困难，例如，用户经常较忙，难以安排时间；面谈时信息量大，记录较为困难；沟通需要很多技巧，同时需要系统分析师具有足够的领域知识等。另外，在访谈时，还可能会遇到一些对于企业来说比较机密和敏感的话题。因此，这看似简单的技术，也需要系统分析师具有丰富的经验和较强的沟通能力。<br>2. 问卷调査<br>问卷调查通过精心设计调查表，然后下发到相关的人员手中，让他们填写答案。问卷调査表使系统分析师可以从大量的项目干系人处收集信息，甚至当项目干系人在地理上分布很广'时，他们仍然能通过问卷调查表来帮助获取需求。一张好的问卷调查表要花费大量的时间进行设计与制作，包括确定问题及其类型、编写问题、设计问卷调査表的格式三个重要活动。<br>问卷调查可以在短时间内，以低廉的代价从大量的回答中收集数据；问卷调査允许回答者匿名填写，大多数用户可能会提供真实信息；问卷调查的结果比较好整理和统计。问卷调查最大的不足就是缺乏灵活性，较好的做法是将用户访谈和问卷调查结合使用。具体来说，就是先设计问题，制作成为问卷调查表，下发填写完后，进行分组、整理和分析，以获得基础信息。然后，再针对分析的结果进行小范围的用户访谈，作为补充。<br>3. 采样<br>采样是指从种群中系统地选出有代表性的样本集的过程，通过认真研究所选出的样本集，可以从整体上揭示种群的有用信息。对于信息系统的开发而言，现有系统的文档(文件）就是采样种群。当开始对一个系统做需求分析时，査看现有系统的文档是对系统有初步了解的最好方法。但是，系统分析师应该查看哪些类型的文档，当文档的数据庞大，无法一一研究时，就需要使用采样技术选出有代表性的数据。<br>采样技术不仅可以用于收集数据，还可以用于采集访谈用户或者是采集观察用户。在对人员进行采样时，上面介绍的采样技术同样适用。通过采样技术，选择部分而不是选择种群的全部，不仅加快了数据收集的过程，而且提高了效率，从而降低开发成本。另外，采样技术使用了数理统计原理，能减少数据收集的偏差。但是，由于采样技术基于统计学原理，样本规模的确定依赖于期望的可信度和已有的先验知识，很大程度上取决于系统分析师的主观因素，对系统分析师个人的经验和能力依赖性很强，要求系统分析师具有较高的水平和丰富的经验。<br>4. 情节串联<br>很多用户对信息系统是没有直观认识的，这样就很容易产生盲区，这时，系统分析师就需要通过情节串联板技术来帮助用户消除盲区，达成共识。情节串联板通常就是一系列图片，系统分析师通过这些图片来讲故事。在一般情况下，图片的顺序与活动事件的顺序一致，通过一系列图片说明会发生什么。人们发现，通过以图片辅助讲故事的方式叙述需求，有助于有效和准确地沟通。在情节串联板中可以使用的图片类型包括流程图、交互图、报表和记录结构等。简单地说，情节串联板技术就是使用工具向用户说明(或演示）系统如何适合企业的需要，并表明系统将如何运转。系统分析师将初始的情节串联板展示给讨论小组，小组成员提供意见。<br>由于情节串联板给用户一个直观的演示，因此它是最生动的需求获取技术，其优点是用户友好、交互性强，对用户界面提供了早期的评审。情节串联板的缺点是花费的时间很多，需求获取的效率较低。<br>5.联合需求计划<br>为了提高需求获取的效率，越来越多的企业倾向于使用小组工作会议来代替大量独立的访谈。联合需求计划（Joint Requirement Planning,JRP)是一个通过高度组织的群体会议来分析企业内的问题并获取需求的过程，它是联合应用开发（Joint Application Development,JAD)的一部分。JAD是以小组形式定义和建立系统的，它是由企业主管部门经理、会议主持人、用户、协调人员、IT人员、秘书等共同组成的专题讨论组。由这个专题讨论组来定义并详细说明系统的需求和可选的技术方案。JAD的过程大致如下：(1)确定JAD项目，主要指确定系统的范围和规范。（2）在JAD专题预备会上，会议主持人向参与者介绍项目和JAD专题讨论内容。（3）准备JAD专题讨论材料。（4）进行JAD专题讨论会，其目的是要达成对需求的一致意见，并对各种可选的技术方案加以讨论，从中研究出几套可供选择的方案。<br>JAD方法充分发挥了JAD专题讨论会的优势，以更好地满足用户的需求。使用JAD法，比传统的收集需求的时间更快，可以加速系统开发周期。JAD方法充分发挥了管理人员和用户的积极性，增强了管理人员和用户的责任感，从而使系统开发工作做得更好。JRP将会起到群策群力的效果，对于一些问题最有歧义的时候、对需求最不清晰的领域都是十分有用的一种方法。这种方法最大的难度是会议的组织和相关人员的能力，要做到言之有物，气氛开放。否则，将难以达到预想的效果。<br>三、针对考生本人所参与的项目中使用的需求获取技术，说明实施过程和具体实施效果。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235584342347777",
        "title": "论面向对象设计方法及其应用<br> 系统设计是根据系统分析的结果，运用系统科学的思想和方法，设计出能满是用户所要求的目标（或目的）系统的过程。面向对象设计方法是一种接近现实的系统设计方法。在该方法中，数据结构和在数据结构上定义的操作算法封装在一个对象之中。\n请围绕“面向对象设计方法及其应用”论题，依次从以下三个方面进行论述。<br> 1.概要叙述你参与管理和开发的软件项目以及你在其中所承担的主要工作。<br> 2.面向对象设计方法包含多种设计原则，请简要描述其中的三种设计原则。<br> 3.具体阐述你参与管理和开发的项目是如何遵循这三种设计原则进行信息系统设计的。",
        "analyze": "论文暂无解析",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235597596348417",
        "title": "试题一 论面向服务的信息系统开发方法及其应用<br> 信息系统是一个极为复杂的人机交互系统，它不仅包含计算机技术、通信技术却网络技术，以及其他的工程技术，而且，它还是一个复杂的管理系统，需要管理理论和方法的支持。如何选择一个合适的开发方法，以保证在多变的市场环境下，在既定的预算和时间要求范围内，开发出让用户满意的信息系统，这是系统分析师所必须要面临的问题。目前，有多种方法来解决该问题，其中面向服务（Service-Oriented，SO)的开发方法就是一神常见的信息系统开发方法，其将接口的定义与实现进行解释，并将跨构件的功能调用暴露出来。<br>\n请围绕“论面向服务的信息系统开发方法及其应用”论题，依次从以下三个方面进行论述:<br> 1.概要叙述你参与管理和开发的软件项目以及你在其中所承担的主要工作。<br> 2.请简要描述面向服务的开发方法的三个主要抽象级别。<br> 3.请围绕基于面向服务开发方法的三个主要抽象级别，具体阐述你参与管理和开发的项目是如何进行系统开发的。",
        "analyze": "写作要点<br> 一、简要叙述所参与管理和开发的软件项目，需要明确指出在其中承担的主要任务和开展的主要工作。<br> 二、信息系统开发方法描述如下。<br> 面向服务的信息系统开发方法有三个主要的抽象级别：操作、服务和业务流程。<br> 位于最底层的操作代表单个逻辑单元的事物，执行操作通常会导致读、写或修改一个或多个持久性数据。服务的操作类似于对象的方法，它们都有特定的结构化接口,并且返回结构化的响应。位于第二层的服务代表操作的逻辑分组。最高层的业务流程则是为了实现特定业务目标而执行的一组长期运行的动作或活动，包括依据一组业务规则按照有序序列执行的一系列操作。其中操作的排序、选择和执行成为服务或流程的编排，典型的情况是调用已编排的服务来响应业务事件。<br> 二、论文中需要结合项目实际工作，详细论述在项目中是如何基于面向服务的开发方法进行信息系统开发的。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235587957837825",
        "title": "试题一<br>\n论面向对象的信息系统分析方法<br>\n信息系统分析是信息系统生命周期的重要阶段之一，是使用系统的观点和方法，把复杂系统分解为简单组成部分并确定这些组成部分的基本属性和关系的过程。在此过程中可使用多种分析方法,以及相应的辅助工具。其中，面向对象分析方法（Object-Oriented AnalysisMethod,00AM）是在系统开发过程中进行了系统业务调查后，按照面向对象的思想来分析问题的方法。<br>\n请围绕“面向对象的信息系统分析方法”论题，依次从以下三个方面进行论述。<br>\n1.概要叙述你参与管理和开发的软件项目以及你在其中所承担的主要工作。<br>\n2．请简要描述面向对象系统分析方法的主要步骤。<br>\n3.具体阐述你参与管理和开发的项目是如何基于面向对象分析方法进行信息系统分析的。",
        "analyze": "写作要点<br>\n一、简要叙述所参与管理和开发的软件项目，需要明确指出在其中承担的主要任务和开展的主要工作。<br>\n二、面向对象分析方法通常按照下面的步骤来进行:<br>\n（1）标识对象和类。可以从应用领域开始，逐步确定形成整个应用的基础类和对象。这一步需要分析领域中目标系统的责任，调查系统的环境，从而确定对系统有用的类和对象。（2）标识结构。典型的结构有两种，即一般-特殊结构和整体-部分结构。一般-特殊结构表示一般类是基类，特殊类是派生类。比如，汽车是轿车和卡车的基类，这是一种一般-特殊结构。整体-部分结构表示聚合，由属于不同类的成员聚合成为新的类。比如，轮子、车体和汽车底盘都是汽车的一部分，这些不同功能的部件聚合成为汽车这个整体。<br>\n（3）标识属性。对象所保存的信息称为它的属性。类的属性描述状态信息，在类的某个实例中，属性的值表示该对象的状态值。需要找出每个对象在目标系统中所需要的属性，并将属性安排在适当的位置，找出实例连接，最后再进行检查。应该给出每个属性的名字和描述，并指定该属性所受的特殊限制(如只读、属性值限定在某个范围之内等)。<br>\n（4）标识服务。对象收到消息后执行的操作称为对象提供的服务。它描述了系统需要执行的处理和功能。定义服务的目的是定义对象的行为和对象之间的通信。<br>\n（5）标识主题。为了更好地理解包含大量类和对象的概念模型，需要标识主题，即对模型进行划分,给出模型的整体框架，划分出层次结构。<br>\n三、论文中需要结合项目实际工作，详细论述在项目中是如何基于面向对象的分析方法进行信息系统分析的。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235573047087105",
        "title": "试题一，给信息系统可行性分析，信息系统可行性分析的目的是确认在当前条件下企业是否有必要建设新系统，以及建设新系统的工作是否具备必要的条件，如何进行可行性分析是系统分析师所必须面临的问题。请围绕信息系统可行性分析论题，依次从以下三个方面进行论述。<br>\n1.概要叙述你参与管理和开发的软件项目，以及你在其中承担的主要工作。<br>\n2.请简要描述应从哪些方面完成信息系统的可行性分析?<br>\n3.具体阐述你参与管理和开发的项目是如何从不同的方面进行系统可行性分析的。",
        "analyze": "暂无",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235601878732801",
        "title": "试题三 论软件设计模式及其应用<br> 设计模式（Design Pattern)是一套被反复使用的代码设计经验总结，代表了软件开发人员在软件开发过程中面临的一般问题的解决方案和最佳实践。使用设计模式的目的是提高代码的可重用性,让代码更容易被他人理解，并保证代码可靠性。现有的设计模式已经在前人的系统中得以证实并广泛使用，它使代码编写真正实现工程化，将已证实的技术表述成设计模式，也会使新系统开发者更加容易理解其设计思路。根据目的和用途不同，设计模式可分为创建型（creational)模式、结构型（structural)模式和行为型（behavioral)模式三种。&nbsp;<br>\n请围绕“论软件设计模式及其应用”论题，依次从以下三个方面进行论述：<br> 1.简要叙述你参与的软件开发项目以及你所承担的主要工作。<br> 2.详细说明每种设计模式的特点及其所包含的具体设计模式，每个类别至少详细说明两种代表性设计模式。<br> 3.根据你所参与的项目，论述具体采用了哪些设计模式，其实施效果如何。",
        "analyze": "写作要点<br> 一、简要描述所参与的软件系统开发项目，并明确指出在其中承担的主要任务和开展的主要工作。<br> 二、详细说明每种设计模式的特点及其所包含的具体设计模式，每个类別至少详细说明两种代表性设计模式。<br> 1.创建型模式。<br> 创建型模式对类的实例化过程（即对象的创建过程）进行了抽象，能够使软件模块做到与对象的创建和组织无关。创建型模式隐藏了对象是如何被创建和组合在一起的，以达到使整个系统独立的目的。创建型模式包括工厂方法模式、抽象工厂模式.，原型模式、单例模式和建造者模式等。<br> 2.结构型模式。<br> 结构型模式描述如何将类或对象结合在一起形成更大的结构。结构型模式描述两种不同的事物，即类与类的实例（对象），根据这一点，可以分为类结构型模式和对象结构型模式。 结构型模式包括适配器模式、桥接模式、组合模式、装饰模式、外观模式、享元模弍和代理模式等。<br> 3.行为型模式。<br> 行为型模式足在不同的对象之间划分责任和算法的抽象化，它不仅仅是关于类和对象的，而且是关于它们之间的相互作用的。行为型模式分为类行为模式和对象行为模式两种，其中类行为模式使用继承关系在几个类之间分配行为，而对象行为模式则使用对象的聚合来分配行为。行为型模式包括职责链模式、命令模式、解释器模式、迭代器模式、中介者模式、备忘录模式、观察者模式、状态模式、策略模式、模板方法模式、访问者模式等。<br> 三、针对考生本人所参与的项目中使用的设计模式，说明实施过程和具体实施效果。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235591900483585",
        "title": "试题三<br>\n论富互联网应用的客户端开发技术<br>\n富互联网应用(Rich Internet Application,RIA）是一种新型Web应用程序架构。它结合了桌面软件良好的用户体验和Web应用程序易部署的优点,利用丰富的数据模型和丰富的客户端呈现形式，保证了在无刷新页面之下提供更高效的界面响应速度和通用的用户界面特征，迅速响应用户输入并进行相应处理，从而为用户构建一个快速响应、交互性强的应用程序。近年来，各技术厂商相继推出了多种新的技术来支持RIA应用开发。<br>\n请围绕“富互联网应用的客户端开发技术”论题，依次从以下三个方面进行论述。<br>\n1.简要叙述你参与的软件开发项目以及你所承担的主要工作。<br>\n2.说明目前有哪些主要的RIA客户端开发技术，详细阐述每种技术的特点和优势。<br>\n3.根据你所参与的项目，具体采用了哪种RIA客户端开发技术，其实施效果如何。",
        "analyze": "写作要点<br>\n一、简要描述所参与的软件系统开发项目，并明确指出在其中承担的主要任务和开展的主要工作。<br>\n二、说明目前有哪些主要的RIA客户端开发技术，详细阐述每种技术的特点和优势。<br>\n(1) Flex。<br>\nFlex是一个表示服务器和应用程序框架，它可以运行于J2EE 和.NET 平台。Flex应用程序框架由MXML (Macromedia XML)、ActionScript和Flex类库构成。开发人员利用MXML定义应用程序用户界面元素，利用ActionScript 定义客户逻辑与程序控制。Flex类库中包括Flex组件、管理器和行为等。<br>\n(2) Bindows。<br>\nBindows是用JavaScript和 DHTML (Dynamic HTML，动态 HTML)开发的Web窗口框架。JavaScript用于客户端界面的显示和处理，XML和 HTTP用于客户端与服务器的信息传输。<br>\n（3） Java。<br>\n一些相当复杂的系统都是用Java 编写的，这说明可以用Java来建立几乎任何一个能够想象得到的RIA。使用Java建立RIA 的主要缺陷是它的复杂性，例如，即使对简单的窗口和图形,也要求编写非常烦琐的代码。<br>\n（4） Laszlo。<br>\nLaszlo是一个开源的RIA开发环境。使用Laszlo平台时，开发人员只需编写名为LZX的描述语言（其中整合了XML 和JavaScript)，运行在J2EE 应用服务器上的 Laszlo表示服务器会将其编译成SWF格式的文件并传输给客户端展示。<br>\n(5) XUL。<br>\nXUL (XML User Interface Language，基于 XML 的用户界面语言）可用于建立窗口应用系统，这些系统既可以在Mozilla浏览器上运行，也可以在其他描述引擎上运行。XUL描述引擎都非常小，它既可以使用XML 数据，也可以生成XML数据。<br>\n（6）Avalon。<br>\nAvalon是 Vista的一部分，是一个图形和展示引擎,主要由.NET框架中的一组类集合而成。Avalon定义了一个在 Longhorn中使用的新标记语言，其代号为 XAML (eXtensibleApplication Markup Language)，即可扩展应用标记语言。可以使用XAML 来定义文本、图像和控件的布局，程序代码可以直接嵌入到XAML 中，也可以将它保留在一个单独的文件内。<br>\n三、针对考生本人所参与的项目中使用的RIA客户端开发技术,说明实施过程和具体实施效果。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235577107173377",
        "title": "试题三、给敏捷开发方法，敏捷软件开发遵循一套软件开发的价值和原则，在开发中，需求和解决方案通过自组织跨功能的团队达成。敏捷软件开发主张适度计划，迭代开发，提前交付与持续改进，并且快速灵活地应对变更，作为敏提开发方法之一，Scrum方法被广泛应用。<br>\n请围绕敏捷开发方法论题从以下3点进行论述。<br>\n1.概要叙述你参与管理和开发的软件项目，以及你在其中担任的主要工作<br>\n2.请简要“摘述Scrum的提开发方法中的角色、工件和活动。<br>\n3.具体阐述你参与管理和开发的项目如何基于Scrum敏捷开放方法进行系统开放的",
        "analyze": "暂无",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235599618002945",
        "title": "试题二 论快速应用开发方法及其应用<br> 快速应用开发（Rapid Application Development, RAD)是一种比传统生命周期法快得多的信息系统开发方法，它强调极短的开发周期。RAD模型是瀑布模型的一个变种，通过使用基于构件的开发方法进行快速开发。如果需求理解得很好，且约束了项目范围，利用这种模型可以很快开发出功能完善的信息系统。RAD强调复用已有的程序结构或使用构件，或者创建可复用的构件。一般来说，如果一个业务能够被模块化，且其中每一个主要功能均可以在不到三个月的时间内完成，它就适合采用RAD方法。每个主要功能可由一个单独的RAD组来实现，最后再集成起来，形成一个整体。<br>\n请围绕“论快速应用开发方法及其应用”论题，依次从以下三个方面进行论述：<br> 1.概要叙述你参与管理和开发的软件项目以及你在其中所承担的主要工作。<br> 2.RAD方法的流程从业务建模开始，随后是数据建模、过程建模、应用生成、测试与交付。请简要对上述5个步骤的主要工作和特点进行论述。<br> 3.具体阐述你参与管理和开发的项目是如何采用RAD方法进行开发的，并围绕上述5个步骤，详细论述在项目开发过程中遇到了哪些实际问题，是如何解决的。",
        "analyze": "写作要点<br> 一、简要叙述所参与管理和开发的软件项目，需要明确指出在其中承担的主要任务和开展的主要工作。<br> 二、RAD方法的流程主要包括以下5个步骤：<br> (1)业务建模。确定驱动业务过程运作的信息、要生成的信息、如何生成、信息流的去向及其处理等，可以使用数据流图来帮助建立业务模型。<br> (2)数据建模。为支持业务过程的数据流查找数据对象集合、定义数据对象属性，并与其他数据对象的关系构成数据模型，可以使用E-R图来帮助建立数据模型。<br> (3)过程建模。将数据对象变换为要完成一个业务功能所需的信息流，创建处理描述以便增加、修改、删除或获取某个数据对象，即细化数据流图中的加工。<br> (4)应用生成。利用第四代语言（4GL)写出处理程序，复用已有构件或创建新的可复用构件，利用环境提供的工具自动生成并构造出整个应用系统。<br> (5)测试与交付。因为RAD强调复用，许多构件已经是测试过的，这就减少了测试的时间。由于大量复用，所以一般只做总体测试，但新创建的构件还是要进行充分测试。<br> 三、论文中需要结合项目实际工作，详细论述在项目中是如何采用RAD方法进行项目开发的，并围绕RAD方法的5个主要步骤，描述在实际开发过程中遇到了哪些具体问题，采用何种方法解决的。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235589937549313",
        "title": "试题二<br>\n论静态测试方法及其应用<br>\n软件测试是在将软件交付给客户之前所必须完成的重要步骤之一。目前，软件的正确性证明技术尚不成熟，软件测试仍是发现软件错误的主要手段。软件测试方法可分为静态测试和动态测试，其中静态测试是指被测程序不在机器上运行，而通过人工检测和计算机辅助的手段对程序进行测试，该方法能够有效地发现软件30%~70%的设计和编码错误。<br>\n请围绕“静态测试方法及其应用”论题，依次从以下三个方面进行论述。<br>\n1.概要叙述你参与管理和开发的软件项目,以及你在其中所承担的主要工作。<br>\n2．详细论述静态测试主要方法的内容和过程。<br>\n3.结合你具体参与管理和开发的实际项目，说明如何进行静态测试,并说明如何选择合适的静态测试方法及具体实施过程和效果。",
        "analyze": "写作要点<br>\n一、简要叙述所参与管理和开发的软件项目，并明确指出在其中承担的主要任务和开展的主要工作。<br>\n二、静态测试是指被测程序不在机器上运行，而采用人工检测和计算机辅助静态分析的手段对程序进行测试。静态测试的目标包括文档和代码。对代码的静态测试一般采用桌前检查、代码审查、代码走查。经验表明，使用这种方法能够有效地发现30%～70%的逻辑设计错误和编码错误。<br>\n桌前检查:由程序员检查自己编写的程序。程序员在程序通过编译之后，进行单元测试之前，对程序源代码进行分析、检验，并补充相关的文档，目的是发现程序中的错误。由于程序员熟悉自己的程序及其程序设计风格,可以节省很多的检查时间,但应避免主观片面性。<br>\n代码审查:代码审查是由若干程序员和测试员组成一个评审小组，通过阅读、讨论和争议，对程序进行静态分析的过程。在会上，首先由程序员逐句解释程序的逻辑。在此过程中，程序员或其他小组成员可以提出问题，展开讨论，审查错误是否存在。实践表明，程序员在审查的过程中能发现许多原来自己没有发现的错误，而讨论和争议则促进了问题的暴露。<br>\n代码走查:走查与代码审查基本相同，但开会的程序与代码审查不同,走查不是简单地读程序和对照错误检查表进行检查，而是让与会者“充当”计算机，即首先由测试组成员为所测试程序准备一批有代表性的测试用例，提交给走查小组。走查小组开会，集体扮演计算机角色，让测试用例按照程序的逻辑运行一遍，随时记录程序的踪迹，供分析和讨论用。<br>\n静态分析:静态分析是指在不运行代码的方式下，通过词法分析、语法分析、控制流、数据流分析等技术对程序代码进行扫描，验证代码是否满足规范性、安全性、可靠性、可维护性等指标的一种代码分析技术。目前静态分析技术向模拟执行的技术发展，以能够发现更多传统意义上动态测试才能发现的缺陷，例如符号执行、抽象解释、值依赖分析等，并采用数学约束求解工具进行路径约减或者可达性分析以减少误报,增加分析效率。<br>\n三、考生需结合自身参与项目的实际状况，指出其参与管理和开发的项目中所进行的静态测试工作，说明静态测试的具体实施过程、如何选择静态测试方法，并对实际应用效果进行分析。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235575173599233",
        "title": "试题二、论Devops及其应用。Devops是—组过程、方法与系统的统称，用于促进开发、技术运营和质量保障部门之间的沟通，协协作与整合。它是—种重视软体开发人员和工厂运维技术人员之间沟通合作的模式。透过自动化“软件交付\"和“架构变更”\"的流程，使得构建、测试，发布软件能够更加快堤、频繁和可靠。<br>\n请围绕“Devops及其应用\"论题，依次从以下三个方面进行论述。<br>\n1.概要叙述你参与管理和开发的软件项目，以及你在其中担任的主要工作.<br>\n2.结合你具体参与管理和开发的的实际项目，伴细给述是哪些因素促使你决走引入Devops<br>\n3.结合你具体参与管理和开发的实际项目说明在引入DevOps后，对应用程序发布有哪些影响。",
        "analyze": "暂无",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235603850055681",
        "title": "试题四 论遗留系统演化策略及其应用<br> 遗留系统是指任何基本上不能进行修改和演化以满足新的变化了的业务需求的信息系统。在企业信息系统升级改造过程中，如何处理和利用遗留系统，成为新系统建设中的重要问题，而处理恰当与否，直接关系到新系统的成败和开发效率。遗留系统的演化方式有多种，究竟采用哪些策略来处理遗留系统，需要根据对遗留系统的评价结果来确定。\n请围绕“论遗留系统演化策略及其应用”论题，依次从以下三个方面进行论述： 1.概要叙述你参与管理和开发的软件项目，以及你在其中所枳任的主要工作。 2.详细论述遗留系统评价的主要活动，论述常见的演化策略。 3.结合你具体参与管理和开发的实际项问，说明如何进行遗留系统评价并选择合适的演化策略，请说明具体实施过程以及应用效果。",
        "analyze": "写作要点<br> 一、简要叙述所参与管理和开发的软件项目，并明确指出在其中承担的主要任务和开展的主要工作。<br> 二、对遗留系统评价的目的是获得对遗留系统更好的理解，是遗留系统演化的基础。主要评价方法包括度量系统技术水准、商业价值和与之关联的企业特征，其结果作为选择处理策略的基础。评价方法由一系列活动组成：<br> 1.启动评价：评价准备，数据搜集过程。<br> 2.业务价值评价：主要是判断遗留系统对企业的重要程度。<br> 3.外部环境评价：包括硬件、支撑软件和企业IT基础设施的统一体。<br> 4.应用软件评价：遗留系统本身的特征评价。<br> 5.分析评价结果：按照业务评价分值和技术水平分值的高低组合，将评价结果分为四种。<br> 根据四种评价结果选择不同的遗留系统演化策略。<br> 1.淘汰策略：评价结果为业务价值低、技术水平低的遗留系统。<br> 2.继承策略：评价结果为业务价值高、技术水平低的遗留系统。<br> 3.改造策略：评价结果为业务价值高、技术水平高的遗留系统<br> 4.集成策略：评价结果为业务价值低、技术水平高的遗留系统。<br> 三、考生需结合自身参与项目的实际状况，指出其参与管理和开发的项目中所进行的遗留系统评价与演化，说明评价活动的具体实施过程、演化策略如何选择，并对实际应用效果进行分析。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235594047967233",
        "title": "试题四<br>\n论DevSecOps技术及其应用<br>\n随着互联网技术不断发展，网络安全面临着更大的挑战，IT安全防护显得越来越重要。采用DevOps技术能够有效推进软件开发的效率，提高迭代速度。但是，在传统的DevOps技术实施过程中，安全防护在开发的最后阶段才介入，延后的安全措施可能会拖累整个流程，严重影响DevOps的实施速度和效果。在这一背景下，业界普遍认为安全防护是整个IT团队的共同责任，需要贯穿至整个生命周期的每一个环节,由此催生出了“DevSecOps”这一概念，它强调在项目计划启动初期,必须为DevOps计划打下扎实的安全基础。<br>\n请围绕“DevSecOps技术及其应用”论题，依次从以下三个方面进行论述。<br>\n1.概要叙述你参与管理和开发的软件项目以及你在其中所承担的主要工作。<br>\n2.详细描述DevSecOps包含的主要阶段和每个阶段需要完成的工作。<br>\n3．结合你具体参与管理和开发的实际软件项目，说明是如何应用 DevSecOps 技术进行开发、运维、安全一体化管理的,给出具体实施过程以及应用效果。",
        "analyze": "写作要点<br>\n一、简要叙述所参与管理和开发的软件项目，并明确指出在其中承担的主要任务和开展的主要工作。<br>\n二、典型的 DevOps流程包括计划、编码、构建、测试、发布和部署等阶段。在DevSecOps中，每个阶段都会应用特定的安全检查。<br>\n（1）计划:执行安全性分析并创建测试计划，以确定在何处、如何以及何时进行测试的方案。<br>\n（2）编码:部署检查工具和代码仓库控件（如Git控件）以保护密码和API密钥。（3）构建:在构建执行代码时，结合使用静态应用程序安全测试（SAST）工具来跟踪代码中的缺陷,然后再部署到生产环境中。这些工具针对特定的编程语言。<br>\n（4）测试:在运行时使用动态应用程序安全测试（DAST)工具来测试应用程序。这些工具可以检测用户身份验证、授权、SQL注入以及与 API相关端点的错误。<br>\n(5)发布:在发布应用程序之前，使用安全分析工具来进行全面的渗透测试和漏洞扫描。（6）部署:在运行时完成上述测试后,将安全的版本发送到生产环境中以进行最终部署。三、考生需结合自身参与项目的实际状况，指出其参与管理和开发的项目中是如何应用DevSecOps 技术进行开发、运维、安全一体化管理的，说明具体实施过程、使用的方法，并对实际应用效果进行分析。",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      },
      {
        "id": "796235579082690561",
        "title": "试题四、信息系统数据转换和迁移。当新系统开发完毕准备取代现有系统时，就要面临新l日系统转化，系统转化是指运用某种方式由现有系统的工作方式向新系统工作方式的转化过程，也是系统设备，数据，人员等的转化过程，数据转化和迁移是新旧系统转化交接的重要工作之一。其基本原则就是数据不丢失。为使数据能平滑迁移到新系统，在新系统设计阶段就需尽量保留现有系统中合格的数据结构。这样才能尽可能的降低数据迁移的工作量和转换难度，数据迁移的质量是新系统上线的前提，也是新系统转换运行的保障，对系统切换至新系统的运行有着重要作用。<br>\n请围绕\"”信息系统数据转换与迁移\"论题，依次从三个方面论述<br>\n1.概要叙述你参与转化和交换的信息系统以及所担任的主要任务和主要工作<br>\n2.信息系统的数据转换与迁徙过程中可大致分为数据抽取，数据转换和数据迁移后的校验等三项活动，请对这三项活动的内涵和要点进行阐述。<br>\n3.详细说明你所参与转换和交接信息系统是如何进行数据转换和迁移工作的在，这一过程中遇到了哪些实际问题，是如何解决的。",
        "analyze": "暂无",
        "multi": 0,
        "questionType": 3,
        "answer": "",
        "chooseItem": null,
        "itemList": null,
        "userAnswer": "",
        "userChooseItem": null,
        "answerCorrect": null,
        "userCollect": 1,
        "notebookNum": 0
      }
    ],
    "other": null
  }
}
